
// 请只在 "
// ########## 下面可以改动

// ########## 上面可以改动 "
// 给定一个排序数组和一个目标值，在数组中找到目标值，并返回其索引。如果目标值不存在于数组中，返回它将会被按顺序插入的位置。
//
// 你可以假设数组中无重复元素。
//
// 示例 1:
//
// 输入: [1,3,5,6], 5
// 输出: 2
// 示例 2:
//
// 输入: [1,3,5,6], 2
// 输出: 1
// 示例 3:
//
// 输入: [1,3,5,6], 7
// 输出: 4
// 示例 4:
//
// 输入: [1,3,5,6], 0
// 输出: 0


package main

import "fmt"

func TEST_DO_NOT_CHANGE(lst_input []int, num int) int {
    fmt.Println(lst_input, num)
    idx_rlt := -1
    // ########## 开始作答
        
    
    // ########## 结束作答  
    return idx_rlt
}

func main() {
    fmt.Println(TEST_DO_NOT_CHANGE([]int{1, 3, 5, 6}, 0))
}
